using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows.Forms;

namespace Tehilim_119
{
    public partial class Screen : Form
    {
        byte X, Y, Z;
        public Screen()
        {
            InitializeComponent();
        }

        private void T(object sender, EventArgs e)
        {
            char Ot = 'א';
            int S, M, H;
            int[] fl = new int[5];
            S = DateTime.Now.Second;
            M = DateTime.Now.Minute;
            H = DateTime.Now.Hour;

            fl[0] = M % 5;
            fl[1] = 4 * (H % 2) + M / 15;
            fl[2] = S / 20;
            if (H < 6)
            {
            fl[3] = 3;
            }
            else
            {
            fl[3] = H/6-1;
            }
            fl[4] = 3*((H/2)%3)+((M/5)%3);
            switch (fl[0])
            {
            case 0:
            X = 0xFF; Y = 0xFF; Z = 0xFF;
            break;

            case 1:
            X = 0x00; Y = 0xFF; Z = 0xFF;
            break;

            case 2:
            X = 0xFF; Y = 0x00; Z = 0xFF;
            break;

            case 3:
            X = 0xFF; Y = 0xFF; Z = 0x00;
            break;

            case 4:
            X = 0x00; Y = 0xFF; Z = 0x80;
            break;

            default:
            break;
            }
            switch (fl[2])
            {
            case 0:
             switch (fl[4])
             {
             case 0:
             Ot = 'א';
             break;

             case 1:
             Ot = 'ז';
             break;

             case 2:
             Ot = 'מ';
             break;

             case 3:
             Ot = 'ג';
             break;

             case 4:
             Ot = 'ט';
             break;

             case 5:
             Ot = 'ס';
             break;

             case 6:
             Ot = 'ה';
             break;

             case 7:
             Ot = 'כ';
             break;

             case 8:
             Ot = 'פ';
             break;

             default:
             break;
             }
            break;

            case 1:
             switch (fl[3])
             {
             case 0:
             Ot = 'ק';
             break;

             case 1:
             Ot = 'ר';
             break;

             case 2:
             Ot = 'ש';
             break;

             case 3:
             Ot = 'ת';
             break;

             default:
             break;
             }
            break;

            case 2:
             switch (fl[4])
             {
             case 0:
             Ot = 'ב';
             break;

             case 1:
             Ot = 'ח';
             break;

             case 2:
             Ot = 'נ';
             break;

             case 3:
             Ot = 'ד';
             break;

             case 4:
             Ot = 'י';
             break;

             case 5:
             Ot = 'ע';
             break;

             case 6:
             Ot = 'ו';
             break;

             case 7:
             Ot = 'ל';
             break;

             case 8:
             Ot = 'צ';
             break;

             default:
             break;
             }
            break;

            default:
            break;
            }

            switch (Ot)
            {
            case 'א':
             switch (fl[1])
             {
             case 0:
             L0.Text = "אַשְׁרֵי תְמִימֵי דָרֶךְ";
             L1.Text = "הַהֹלְכִים בְּתוֹרַת יְהוָה";
             break;

             case 1:
             L0.Text = "אַשְׁרֵי נֹצְרֵי עֵדֹתָיו";
             L1.Text = "בְּכָל לֵב יִדְרְשׁוּהוּ";
             break;

             case 2:
             L0.Text = "אַף לֹא פָעֲלוּ עַוְלָה";
             L1.Text = "בִּדְרָכָיו הָלָכוּ";
             break;

             case 3:
             L0.Text = "אַתָּה צִוִּיתָה פִקֻּדֶיךָ";
             L1.Text = "לִשְׁמֹר מְאֹד";
             break;

             case 4:
             L0.Text = "אַחֲלַי יִכֹּנוּ דְרָכָי";
             L1.Text = "לִשְׁמֹר חֻקֶּיךָ";
             break;

             case 5:
             L0.Text = "אָז לֹא אֵבוֹשׁ";
             L1.Text = "בְּהַבִּיטִי אֶל כָּל מִצְוֹתֶיךָ";
             break;

             case 6:
             L0.Text = "אוֹדְךָ בְּיֹשֶׁר לֵבָב";
             L1.Text = "בְּלָמְדִי מִשְׁפְּטֵי צִדְקֶךָ";
             break;

             case 7:
             L0.Text = "אֶת חֻקֶּיךָ אֶשְׁמֹר";
             L1.Text = "אַל תַּעַזְבֵנִי עַד מְאֹד";
             break;

             default:
             break;
             }
            break;

            case 'ב':
            switch (fl[1])
                    {
                        case 0:
                            L0.Text = "בַּמֶּה יְזַכֶּה נַּעַר";
                            L1.Text = "אֶת אָרְחוֹ לִשְׁמֹר כִּדְבָרֶךָ";
                            break;

                        case 1:
                            L0.Text = "בְּכָל לִבִּי דְרַשְׁתִּיךָ";
                            L1.Text = "אַל תַּשְׁגֵּנִי מִמִּצְוֹתֶיךָ";
                            break;

                        case 2:
                            L0.Text = "בְּלִבִּי צָפַנְתִּי אִמְרָתֶךָ";
                            L1.Text = "לְמַעַן לֹא אֶחֱטָא לָך";
                            break;

                        case 3:
                            L0.Text = "בָּרוּךְ אַתָּה יְהוָה";
                            L1.Text = "לַמְּדֵנִי חֻקֶּיךָ";
                            break;

                        case 4:
                            L0.Text = "בִּשְׂפָתַי סִפַּרְתִּי";
                            L1.Text = "כֹּל מִשְׁפְּטֵי פִיךָ";
                            break;

                        case 5:
                            L0.Text = "בְּדֶרֶךְ עֵדְוֹתֶיךָ שַׂשְׂתִּי";
                            L1.Text = "כְּעַל כָּל הוֹן";
                            break;

                        case 6:
                            L0.Text = "בְּפִקֻּדֶיךָ אָשִׂיחָה";
                            L1.Text = "וְאַבִּיטָה אֹרְחֹתֶיךָ";
                            break;

                        case 7:
                            L0.Text = "בְּחֻקֹּתֶיךָ אֶשְׁתַּעֲשָׁע";
                            L1.Text = "לֹא אֶשְׁכַּח דְּבָרֶךָ";
                            break;

                        default:
                        break;
                    }
            break;

            case 'ז':
            switch (fl[1])
                    {
                        case 0:
                            L0.Text = "זְְכֹר דָּבָר לְְעַבְדֶּךָ";
                            L1.Text = "עַל אֲשֶׁר יִחַלְתָּנִי";
                            break;

                        case 1:
                            L0.Text = "זֹאת נֶחָמָתִי בְְעָָנְיִי";
                            L1.Text = "כִּי אִמְרָתְְךָ חִיָּתְנִי";
                            break;

                        case 2:
                            L0.Text = "זֵדִים הֱלִיצֻנִי עַד מְְאֹד";
                            L1.Text = "מִתּוֹרָתְְךָ לֹא נָטִיתִי";
                            break;

                        case 3:
                            L0.Text = "זָכַרְתִּי מִשְׁפָּטֶיךָ מֵעוֹלָם";
                            L1.Text = "יְהֹוָה, וָאֶתְנֶחָם";
                            break;

                        case 4:
                            L0.Text = "זַלְעָפָה אֲחָזַתְנִי מֵרְְשָׁעִים";
                            L1.Text = "עֹזְְבֵי תּוֹרָתֶךָ";
                            break;

                        case 5:
                            L0.Text = "זְְמִרוֹת הָיוּ לִי חֻקֶּיךָ";
                            L1.Text = "בְְּבֵית מְְגוּרָי";
                            break;

                        case 6:
                            L0.Text = "זָכַרְתִּי בַלַּיְלָה שִׁמְךָ יְהֹוָה";
                            L1.Text = "וָאֶשְׁמְְרָה תּוֹרָתֶךָ";
                            break;

                        case 7:
                            L0.Text = "זֹאת הָיְְתָה לִּי";
                            L1.Text = "כִּי פִקֻּדֶיךָ נָצָרְתִּי";
                            break;

                        default:
                            break;
                    }
            break;

            case 'ח':
            switch (fl[1])
                    {
                        case 0:
                            L0.Text = "חֶלְקִי יְהֹוָה אָמַרְתִּי";
                            L1.Text = "לִשְׁמֹר דְְּבָרֶיךָ";
                            break;

                        case 1:
                            L0.Text = "חִלִּיתִי פָנֶיךָ בְְכָָל לֵב";
                            L1.Text = "חָָנֵּנִי כְְּאִמְרָתֶךָ";
                            break;

                        case 2:
                            L0.Text = "חִשַּׁבְתִּי דְְרָכָי";
                            L1.Text = "וָאָשִׁיבָה רַגְלַי אֶל עֵדֹתֶיךָ";
                            break;

                        case 3:
                            L0.Text = "חַשְׁתִּי וְְלֹא הִתְמַהְמָהְתִּי";
                            L1.Text = "לִשְׁמֹר מִצְוֹתֶיךָ";
                            break;

                        case 4:
                            L0.Text = "חֶבְלֵי רְְשָׁעִים עִוְְּדֻנִי";
                            L1.Text = "תּוֹרָתְְךָ לֹא שָׁכָחְתִּי";
                            break;

                        case 5:
                            L0.Text = "חֲצוֹת לַיְלָה אָקוּם לְְהוֹדוֹת לָךְ";
                            L1.Text = "עַל מִשְׁפְְּטֵי צִדְקֶךָ";
                            break;

                        case 6:
                            L0.Text = "חָבֵר אָנִי לְְכָָל אֲשֶׁר יְְרֵאוּךָ";
                            L1.Text = "וּלְשֹׁמְְרֵי פִּקּוּדֶיךָ";
                            break;

                        case 7:
                            L0.Text = "חַסְדְְּךָ יְהֹוָה מָלְְאָה הָאָרֶץ";
                            L1.Text = "חֻקֶּיךָ לַמְְּדֵנִי";
                            break;

                        default:
                            break;
                    }
            break;

            case 'מ':
            switch (fl[1])
                    {
                        case 0:
                            L0.Text = "מָה אָהַבְתִּי תוֹרָתֶךָ";
                            L1.Text = "כָָּל הַיּוֹם הִיא שִׂיחָתִי";
                            break;

                        case 1:
                            L0.Text = "מֵאֹיְְבַי תְְּחַכְְּמֵנִי מִצְוֹתֶךָ";
                            L1.Text = "כִּי לְְעוֹלָם הִיא לִי";
                            break;

                        case 2:
                            L0.Text = "מִכָָּל מְְלַמְְּדַי הִשְׂכַּלְתִּי";
                            L1.Text = "כִּי עֵדְְוֹתֶיךָ שִׂיחָה לִי";
                            break;

                        case 3:
                            L0.Text = "מִזְְּקֵנִים אֶתְבּוֹנָן";
                            L1.Text = "כִּי פִקּוּדֶיךָ נָצָרְתִּי";
                            break;

                        case 4:
                            L0.Text = "מִכָָּל אֹרַח רָע כָּלִאתִי רַגְלָי";
                            L1.Text = "לְְמַעַן אֶשְׁמֹר דְְּבָרֶךָ";
                            break;

                        case 5:
                            L0.Text = "מִמִּשְׁפָּטֶיךָ לֹא סָרְתִּי";
                            L1.Text = "כִּי אַתָּה הוֹרֵתָנִי";
                            break;

                        case 6:
                            L0.Text = "מַה נִּמְלְְצוּ לְְחִכִּי אִמְרָתֶךָ";
                            L1.Text = "מִדְְּבַשׁ לְְפִי";
                            break;

                        case 7:
                            L0.Text = "מִפִּקּוּדֶיךָ אֶתְבּוֹנָן";
                            L1.Text = "עַל כֵּן שָׂנֵאתִי כָָּל אֹרַח שָׁקֶר";
                            break;

                        default:
                            break;
                    }
            break;

            case 'נ':
            switch (fl[1])
                    {
                        case 0:
                            L0.Text = "נֵר לְְרַגְלִי דְְבָרֶךָ";
                            L1.Text = "וְְאוֹר לִנְתִיבָתִי";
                            break;

                        case 1:
                            L0.Text = "נִשְׁבַּעְתִּי וָאֲקַיֵּמָה";
                            L1.Text = "לִשְׁמֹר מִשְׁפְְּטֵי צִדְקֶךָ";
                            break;

                        case 2:
                            L0.Text = "נַעֲנֵיתִי עַד מְְאֹד";
                            L1.Text = "יְהֹוָה חַיֵּנִי כִדְבָרֶךָ";
                            break;

                        case 3:
                            L0.Text = "נִדְבוֹת פִּי רְְצֵה נָא יְהֹוָה";
                            L1.Text = "וּמִשְׁפָּטֶיךָ לַמְְּדֵנִי";
                            break;

                        case 4:
                            L0.Text = "נַפְשִׁי בְְכַפִּי תָמִיד";
                            L1.Text = "וְְתוֹרָתְְךָ לֹא שָׁכָחְתִּי";
                            break;

                        case 5:
                            L0.Text = "נָתְְנוּ רְְשָׁעִים פַּח לִי";
                            L1.Text = "וּמִפִּקּוּדֶיךָ לֹא תָעִיתִי";
                            break;

                        case 6:
                            L0.Text = "נָחַלְתִּי עֵדְְוֹתֶיךָ לְְעוֹלָם";
                            L1.Text = "כִּי שְְׂשׂוֹן לִבִּי הֵמָּה";
                            break;

                        case 7:
                            L0.Text = "נָטִיתִי לִבִּי לַעֲשׂוֹת חֻקֶּיךָ";
                            L1.Text = "לְְעוֹלָם עֵקֶב";
                            break;

                        default:
                            break;
                    }
            break;



            case 'ג':
            switch (fl[1])
                    {
                        case 0:
                            L0.Text = "גְּמֹל עַל עַבְדְּךָ";
                            L1.Text = "אֶחְיֶה וְאֶשְׁמְרָה דְבָרֶךָ";
                            break;

                        case 1:
                            L0.Text = "גַּל עֵינַי";
                            L1.Text = "וְאַבִּיטָה נִפְלָאוֹת מִתּוֹרָתֶךָ";
                            break;

                        case 2:
                            L0.Text = "גֵּר אָנֹכִי בָאָרֶץ";
                            L1.Text = "אַל תַּסְתֵּר מִמֶּנִּי מִצְוֹתֶיךָ";
                            break;

                        case 3:
                            L0.Text = "גָּרְסָה נַפְשִׁי לְתַאֲבָה";
                            L1.Text = "אֶל מִשְׁפָּטֶיךָ בְכָל עֵת";
                            break;

                        case 4:
                            L0.Text = "גָּעַרְתָּ זֵדִים אֲרוּרִים";
                            L1.Text = "הַשֹּׁגִים מִמִּצְוֹתֶיךָ";
                            break;

                        case 5:
                            L0.Text = "גַּל מֵעָלַי חֶרְפָּה וָבוּז";
                            L1.Text = "כִּי עֵדֹתֶיךָ נָצָרְתִּי";
                            break;

                        case 6:
                            L0.Text = "גַּם יָשְׁבוּ שָׂרִים בִּי נִדְבָּרוּ";
                            L1.Text = "עַבְדְּךָ יָשִׂיחַ בְּחֻקֶּיךָ";
                            break;

                        case 7:
                            L0.Text = "גַּם עֵדֹתֶיךָ שַׁעֲשֻׁעָי";
                            L1.Text = "אַנְשֵׁי עֲצָתִי";
                            break;

                        default:
                            break;
                    }
            break;

            case 'ד':
            switch (fl[1])
                    {
                        case 0:
                            L0.Text = "דָּבְקָה לֶעָפָר נַפְשִׁי";
                            L1.Text = "חַיֵּנִי כִּדְבָרֶךָ";
                            break;

                        case 1:
                            L0.Text = "דְּרָכַי סִפַּרְתִּי וַתַּעֲנֵנִי";
                            L1.Text = "לַמְּדֵנִי חֻקֶּיךָ";
                            break;

                        case 2:
                            L0.Text = "דֶּרֶךְ פִּקּוּדֶיךָ הֲבִינֵנִי";
                            L1.Text = "וְאָשִׂיחָה בְּנִפְלְאוֹתֶיךָ";
                            break;

                        case 3:
                            L0.Text = "דָּלְפָה נַפְשִׁי מִתּוּגָה";
                            L1.Text = "קַיְּמֵנִי כִּדְבָרֶךָ";
                            break;

                        case 4:
                            L0.Text = "דֶּרֶךְ שֶׁקֶר הָסֵר מִמֶּנִּי";
                            L1.Text = "וְתוֹרָתְךָ חָנֵּנִי";
                            break;

                        case 5:
                            L0.Text = "דֶּרֶךְ אֱמוּנָה בָחָרְתִּי";
                            L1.Text = "מִשְׁפָּטֶיךָ שִׁוִּיתִי";
                            break;

                        case 6:
                            L0.Text = "דָּבַקְתִּי בְעֵדְוֹתֶיךָ יְהוָה";
                            L1.Text = "אַל תְּבִישֵׁנִי";
                            break;

                        case 7:
                            L0.Text = "דֶּרֶךְ מִצְוֹתֶיךָ אָרוּץ";
                            L1.Text = "כִּי תַרְחִיב לִבִּי";
                            break;

                        default:
                            break;
                    }
            break;

            case 'ט':
            switch (fl[1])
                    {
                        case 0:
                            L0.Text = "טוֹב עָשִׂיתָ עִם עַבְדְּךָ";
                            L1.Text = "יְהוָה כִּדְבָרֶךָ";
                            break;

                        case 1:
                            L0.Text = "טוּב טַעַם וָדַעַת לַמְּדֵנִי";
                            L1.Text = "כִּי בְמִצְוֹתֶיךָ הֶאֱמָנְתִּי";
                            break;

                        case 2:
                            L0.Text = "טֶרֶם אֶעֱנֶה אֲנִי שֹׁגֵג";
                            L1.Text = "וְעַתָּה אִמְרָתְךָ שָׁמָרְתִּי";
                            break;

                        case 3:
                            L0.Text = "טוֹב אַתָּה וּמֵטִיב";
                            L1.Text = "לַמְּדֵנִי חֻקֶּיךָ";
                            break;

                        case 4:
                            L0.Text = "טָפְלוּ עָלַי שֶׁקֶר זֵדִים";
                            L1.Text = "אֲנִי בְּכָל לֵב אֱצֹּר פִּקּוּדֶיךָ";
                            break;

                        case 5:
                            L0.Text = "טָפַשׁ כַּחֵלֶב לִבָּם";
                            L1.Text = "אֲנִי תּוֹרָתְךָ שִׁעֲשָׁעְתִּי";
                            break;

                        case 6:
                            L0.Text = "טוֹב לִי כִי עֻנֵּיתִי";
                            L1.Text = "לְמַעַן אֶלְמַד חֻקֶּיךָ";
                            break;

                        case 7:
                            L0.Text = "טוֹב לִי תוֹרַת פִּיךָ";
                            L1.Text = "מֵאַלְפֵי זָהָב וָכָסֶף";
                            break;

                        default:
                            break;
                    }
            break;

            case 'י':
            switch (fl[1])
                    {
                        case 0:
                            L0.Text = "יָדֶיךָ עָשׂוּנִי וַיְכוֹנְנוּנִי";
                            L1.Text = "הֲבִינֵנִי וְאֶלְמְדָה מִצְוֹתֶיךָ";
                            break;

                        case 1:
                            L0.Text = "יְרֵאֶיךָ יִרְאוּנִי וְיִשְׂמָחוּ";
                            L1.Text = "כִּי לִדְבָרְךָ יִחָלְתִּי";
                            break;

                        case 2:
                            L0.Text = "יָדַעְתִּי יְהוָה";
                            L1.Text = "כִּי צֶדֶק מִשְׁפָּטֶיךָ וֶאֱמוּנָה עִנִּיתָנִי";
                            break;

                        case 3:
                            L0.Text = "יְהִי נָא חַסְדְּךָ לְנַחֲמֵנִי";
                            L1.Text = "כְּאִמְרָתְךָ לְעַבְדֶּךָ";
                            break;

                        case 4:
                            L0.Text = "יְבֹאוּנִי רַחֲמֶיךָ וְאֶחְיֶה";
                            L1.Text = "כִּי תוֹרָתְךָ שַׁעֲשֻׁעָי";
                            break;

                        case 5:
                            L0.Text = "יֵבֹשׁוּ זֵדִים כִּי שֶׁקֶר עִוְּתוּנִי";
                            L1.Text = "אֲנִי אָשִׂיחַ בְּפִקּוּדֶיךָ";
                            break;

                        case 6:
                            L0.Text = "יָשׁוּבוּ לִי יְרֵאֶיךָ";
                            L1.Text = "וְיֹדְעֵי עֵדֹתֶיךָ";
                            break;

                        case 7:
                            L0.Text = "יְהִי לִבִּי תָמִים בְּחֻקֶּיךָ";
                            L1.Text = "לְמַעַן לֹא אֵבוֹשׁ";
                            break;

                        default:
                            break;
                    }
            break;

            case 'ס':
            switch (fl[1])
                    {
                        case 0:
                            L0.Text = "סֵעֲפִים שָׂנֵאתִי";
                            L1.Text = "וְתוֹרָתְךָ אָהָבְתִּי";
                            break;

                        case 1:
                            L0.Text = "סִתְרִי וּמָגִנִּי אָתָּה";
                            L1.Text = "לִדְבָרְךָ יִחָלְתִּי";
                            break;

                        case 2:
                            L0.Text = "סוּרוּ מִמֶּנִּי מְרֵעִים";
                            L1.Text = "וְאֶצְּרָה מִצְוֹת אֱלֹהָי";
                            break;

                        case 3:
                            L0.Text = "סָמְכֵנִי כְאִמְרָתְךָ וְאֶחְיֶה";
                            L1.Text = "וְאַל תְּבִישֵׁנִי מִשִּׂבְרִי";
                            break;

                        case 4:
                            L0.Text = "סְעָדֵנִי וְאִוָּשֵׁעָה";
                            L1.Text = "וְאֶשְׁעָה בְחֻקֶּיךָ תָמִיד";
                            break;

                        case 5:
                            L0.Text = "סָלִיתָ כָּל שׁוֹגִים מֵחֻקֶּיךָ";
                            L1.Text = "כִּי שֶׁקֶר תַּרְמִיתָם";
                            break;

                        case 6:
                            L0.Text = "סִגִים הִשְׁבַּתָּ כָל רִשְׁעֵי אָרֶץ";
                            L1.Text = "לָכֵן אָהַבְתִּי עֵדֹתֶיךָ";
                            break;

                        case 7:
                            L0.Text = "סָמַר מִפַּחְדְּךָ בְשָׂרִי";
                            L1.Text = "וּמִמִּשְׁפָּטֶיךָ יָרֵאתִי";
                            break;

                        default:
                            break;
                    }
            break;

            case 'ע':
            switch (fl[1])
                    {
                        case 0:
                            L0.Text = "עָשִׂיתִי מִשְׁפָּט וָצֶדֶק";
                            L1.Text = "בַּל תַּנִּיחֵנִי לְעֹשְׁקָי";
                            break;

                        case 1:
                            L0.Text = "עֲרֹב עַבְדְּךָ לְטוֹב";
                            L1.Text = "אַל יַעַשְׁקֻנִי זֵדִים";
                            break;

                        case 2:
                            L0.Text = "עֵינַי כָּלוּ לִישׁוּעָתֶךָ";
                            L1.Text = "וּלְאִמְרַת צִדְקֶךָ";
                            break;

                        case 3:
                            L0.Text = "עֲשֵׂה עִם עַבְדְּךָ כְחַסְדֶּךָ";
                            L1.Text = "וְחֻקֶּיךָ לַמְּדֵנִי";
                            break;

                        case 4:
                            L0.Text = "עַבְדְּךָ אָנִי";
                            L1.Text = "הֲבִינֵנִי וְאֵדְעָה עֵדֹתֶיךָ";
                            break;

                        case 5:
                            L0.Text = "עֵת לַעֲשׂוֹת לַיהוָה";
                            L1.Text = "הֵפֵרוּ תּוֹרָתֶךָ";
                            break;

                        case 6:
                            L0.Text = "עַל כֵּן אָהַבְתִּי מִצְוֹתֶיךָ";
                            L1.Text = "מִזָּהָב וּמִפָּז";
                            break;

                        case 7:
                            L0.Text = "עַל כֵּן כָּל פִּקּוּדֵי כֹל יִשָּׁרְתִּי";
                            L1.Text = "כָּל אֹרַח שֶׁקֶר שָׂנֵאתִי";
                            break;

                        default:
                            break;
                    }
            break;



            case 'ה':
            switch (fl[1])
                    {
                        case 0:
                            L0.Text = "הוֹרֵנִי יְהוָה דֶּרֶךְ חֻקֶּיךָ";
                            L1.Text = "וְאֶצְּרֶנָּה עֵקֶב";
                            break;

                        case 1:
                            L0.Text = "הֲבִינֵנִי וְאֶצְּרָה תוֹרָתֶךָ";
                            L1.Text = "וְאֶשְׁמְרֶנָּה בְכָל לֵב";
                            break;

                        case 2:
                            L0.Text = "הַדְרִיכֵנִי בִּנְתִיב מִצְוֹתֶיךָ";
                            L1.Text = "כִּי בוֹ חָפָצְתִּי";
                            break;

                        case 3:
                            L0.Text = "הַט לִבִּי אֶל עֵדְוֹתֶיךָ";
                            L1.Text = "וְאַל אֶל בָּצַע";
                            break;

                        case 4:
                            L0.Text = "הַעֲבֵר עֵינַי מֵרְאוֹת שָׁוְא";
                            L1.Text = "בִּדְרָכֶךָ חַיֵּנִי";
                            break;

                        case 5:
                            L0.Text = "הָקֵם לְעַבְדְּךָ אִמְרָתֶךָ";
                            L1.Text = "אֲשֶׁר לְיִרְאָתֶךָ";
                            break;

                        case 6:
                            L0.Text = "הַעֲבֵר חֶרְפָּתִי אֲשֶׁר יָגֹרְתִּי";
                            L1.Text = "כִּי מִשְׁפָּטֶיךָ טוֹבִים";
                            break;

                        case 7:
                            L0.Text = "הִנֵּה תָּאַבְתִּי לְפִקֻּדֶיךָ";
                            L1.Text = "בְּצִדְקָתְךָ חַיֵּנִי";
                            break;

                        default:
                            break;
                    }
            break;

            case 'ו':
            switch (fl[1])
                    {
                        case 0:
                            L0.Text = "וִיבֹאֻנִי חֲסָדֶךָ יְהוָה";
                            L1.Text = "תְּשׁוּעָתְךָ כְּאִמְרָתֶךָ";
                            break;

                        case 1:
                            L0.Text = "וְאֶעֱנֶה חֹרְפִי דָבָר";
                            L1.Text = "כִּי בָטַחְתִּי בִּדְבָרֶךָ";
                            break;

                        case 2:
                            L0.Text = "וְאַל תַּצֵּל מִפִּי דְבַר אֱמֶת עַד מְאֹד";
                            L1.Text = "כִּי לְמִשְׁפָּטֶךָ יִחָלְתִּי";
                            break;

                        case 3:
                            L0.Text = "וְאֶשְׁמְרָה תוֹרָתְךָ תָמִיד";
                            L1.Text = "לְעוֹלָם וָעֶד";
                            break;

                        case 4:
                            L0.Text = "וְאֶתְהַלְּכָה בָרְחָבָה";
                            L1.Text = "כִּי פִקֻּדֶיךָ דָרָשְׁתִּי";
                            break;

                        case 5:
                            L0.Text = "וַאֲדַבְּרָה בְעֵדֹתֶיךָ נֶגֶד מְלָכִים";
                            L1.Text = "וְלֹא אֵבוֹשׁ";
                            break;

                        case 6:
                            L0.Text = "וְאֶשְׁתַּעֲשַׁע בְּמִצְוֹתֶיךָ";
                            L1.Text = "אֲשֶׁר אָהָבְתִּי";
                            break;

                        case 7:
                            L0.Text = "וְאֶשָּׂא כַפַּי אֶל מִצְוֹתֶיךָ אֲשֶׁר אָהָבְתִּי";
                            L1.Text = "וְאָשִׂיחָה בְחֻקֶּיךָ";
                            break;

                        default:
                            break;
                    }
            break;

            case 'כ':
            switch (fl[1])
                    {
                        case 0:
                            L0.Text = "כָּלְתָה לִתְשׁוּעָתְךָ נַפְשִׁי";
                            L1.Text = "לִדְבָרְךָ יִחָלְתִּי";
                            break;

                        case 1:
                            L0.Text = "כָּלוּ עֵינַי לְאִמְרָתֶךָ";
                            L1.Text = "לֵאמֹר מָתַי תְּנַחֲמֵנִי";
                            break;

                        case 2:
                            L0.Text = "כִּי הָיִיתִי כְּנֹאד בְּקִיטוֹר";
                            L1.Text = "חֻקֶּיךָ לֹא שָׁכָחְתִּי";
                            break;

                        case 3:
                            L0.Text = "כַּמָּה יְמֵי עַבְדֶּךָ";
                            L1.Text = "מָתַי תַּעֲשֶׂה בְרֹדְפַי מִשְׁפָּט";
                            break;

                        case 4:
                            L0.Text = "כָּרוּ לִי זֵדִים שִׁיחוֹת";
                            L1.Text = "אֲשֶׁר לֹא כְתוֹרָתֶךָ";
                            break;

                        case 5:
                            L0.Text = "כָּל מִצְוֹתֶיךָ אֱמוּנָה";
                            L1.Text = "שֶׁקֶר רְדָפוּנִי עָזְרֵנִי";
                            break;

                        case 6:
                            L0.Text = "כִּמְעַט כִּלּוּנִי בָאָרֶץ";
                            L1.Text = "וַאֲנִי לֹא עָזַבְתִּי פִקֻּודֶיךָ";
                            break;

                        case 7:
                            L0.Text = "כְּחַסְדְּךָ חַיֵּנִי";
                            L1.Text = "וְאֶשְׁמְרָה עֵדוּת פִּיךָ";
                            break;

                        default:
                            break;
                    }
            break;

            case 'ל':
            switch (fl[1])
                    {
                        case 0:
                            L0.Text = "לְעוֹלָם יְהוָה";
                            L1.Text = "דְּבָרְךָ נִצָּב בַּשָּׁמָיִם";
                            break;

                        case 1:
                            L0.Text = "לְדֹר וָדֹר";
                            L1.Text = "אֱמוּנָתֶךָ כּוֹנַנְתָּ אֶרֶץ וַתַּעֲמֹד";
                            break;

                        case 2:
                            L0.Text = "לְמִשְׁפָּטֶיךָ עָמְדוּ הַיּוֹם";
                            L1.Text = "כִּי הַכֹּל עֲבָדֶיךָ";
                            break;

                        case 3:
                            L0.Text = "לוּלֵי תוֹרָתְךָ שַׁעֲשֻׁעָי";
                            L1.Text = "אָז אָבַדְתִּי בְעָנְיִי";
                            break;

                        case 4:
                            L0.Text = "לְעוֹלָם לֹא אֶשְׁכַּח פִּקּוּדֶיךָ";
                            L1.Text = "כִּי בָם חִיִּיתָנִי";
                            break;

                        case 5:
                            L0.Text = "לְךָ אֲנִי הוֹשִׁיעֵנִי";
                            L1.Text = "כִּי פִקּוּדֶיךָ דָרָשְׁתִּי";
                            break;

                        case 6:
                            L0.Text = "לִי קִוּוּ רְשָׁעִים לְאַבְּדֵנִי";
                            L1.Text = "עֵדֹתֶיךָ אֶתְבּוֹנָן";
                            break;

                        case 7:
                            L0.Text = "לְכָל תִּכְלָה רָאִיתִי קֵץ";
                            L1.Text = "רְחָבָה מִצְוָתְךָ מְאֹד";
                            break;

                        default:
                            break;
                    }
            break;

            case 'פ':
            switch (fl[1])
                    {
                        case 0:
                            L0.Text = "פְּלָאוֹת עֵדְוֹתֶיךָ";
                            L1.Text = "עַל כֵּן נְצָרָתַם נַפְשִׁי";
                            break;

                        case 1:
                            L0.Text = "פֵּתַח דְּבָרֶיךָ יָאִיר";
                            L1.Text = "מֵבִין פְּתָיִים";
                            break;

                        case 2:
                            L0.Text = "פִּי פָעַרְתִּי וָאֶשְׁאָפָה";
                            L1.Text = "כִּי לְמִצְוֹתֶיךָ יָאָבְתִּי";
                            break;

                        case 3:
                            L0.Text = "פְּנֵה אֵלַי וְחָנֵּנִי";
                            L1.Text = "כְּמִשְׁפָּט לְאֹהֲבֵי שְׁמֶךָ";
                            break;

                        case 4:
                            L0.Text = "פְּעָמַי הָכֵן בְּאִמְרָתֶךָ";
                            L1.Text = "וְאַל תַּשְׁלֶט בִּי כָל אָוֶן";
                            break;

                        case 5:
                            L0.Text = "פְּדֵנִי מֵעֹשֶׁק אָדָם";
                            L1.Text = "וְאֶשְׁמְרָה פִּקּוּדֶיךָ";
                            break;

                        case 6:
                            L0.Text = "פָּנֶיךָ הָאֵר בְּעַבְדֶּךָ";
                            L1.Text = "וְלַמְּדֵנִי אֶת חֻקֶּיךָ";
                            break;

                        case 7:
                            L0.Text = "פַּלְגֵי מַיִם יָרְדוּ עֵינָי";
                            L1.Text = "עַל לֹא שָׁמְרוּ תוֹרָתֶךָ";
                            break;

                        default:
                            break;
                    }
            break;

            case 'צ':
            switch (fl[1])
                    {
                        case 0:
                            L0.Text = "צַדִּיק אַתָּה יְהוָה";
                            L1.Text = "וְיָשָׁר מִשְׁפָּטֶיךָ";
                            break;

                        case 1:
                            L0.Text = "צִוִּיתָ צֶדֶק עֵדֹתֶיךָ";
                            L1.Text = "וֶאֱמוּנָה מְאֹד";
                            break;

                        case 2:
                            L0.Text = "צִמְּתַתְנִי קִנְאָתִי";
                            L1.Text = "כִּי שָׁכְחוּ דְבָרֶיךָ צָרָי";
                            break;

                        case 3:
                            L0.Text = "צְרוּפָה אִמְרָתְךָ מְאֹד";
                            L1.Text = "וְעַבְדְּךָ אֲהֵבָהּ";
                            break;

                        case 4:
                            L0.Text = "צָעִיר אָנֹכִי וְנִבְזֶה";
                            L1.Text = "פִּקֻּדֶיךָ לֹא שָׁכָחְתִּי";
                            break;

                        case 5:
                            L0.Text = "צִדְקָתְךָ צֶדֶק לְעוֹלָם";
                            L1.Text = "וְתוֹרָתְךָ אֱמֶת";
                            break;

                        case 6:
                            L0.Text = "צַר וּמָצוֹק מְצָאוּנִי";
                            L1.Text = "מִצְוֹתֶיךָ שַׁעֲשֻׁעָי";
                            break;

                        case 7:
                            L0.Text = "צֶדֶק עֵדְוֹתֶיךָ לְעוֹלָם";
                            L1.Text = "הֲבִינֵנִי וְאֶחְיֶה";
                            break;

                        default:
                            break;
                    }
            break;



            case 'ק':
            switch (fl[1])
                    {
                        case 0:
                            L0.Text = "קָרָאתִי בְכָל לֵב";
                            L1.Text = "עֲנֵנִי יְהוָה חֻקֶּיךָ אֶצֹּרָה";
                            break;

                        case 1:
                            L0.Text = "קְרָאתִיךָ הוֹשִׁיעֵנִי";
                            L1.Text = "וְאֶשְׁמְרָה עֵדֹתֶיךָ";
                            break;

                        case 2:
                            L0.Text = "קִדַּמְתִּי בַנֶּשֶׁף וָאֲשַׁוֵּעָה";
                            L1.Text = "לִדְבָרְךָ יִחָלְתִּי";
                            break;

                        case 3:
                            L0.Text = "קִדְּמוּ עֵינַי אַשְׁמֻרוֹת";
                            L1.Text = "לָשִׂיחַ בְּאִמְרָתֶךָ";
                            break;

                        case 4:
                            L0.Text = "קוֹלִי שִׁמְעָה כְחַסְדֶּךָ";
                            L1.Text = "יְהוָה כְּמִשְׁפָּטֶךָ חַיֵּנִי";
                            break;

                        case 5:
                            L0.Text = "קָרְבוּ רֹדְפֵי זִמָּה";
                            L1.Text = "מִתּוֹרָתְךָ רָחָקוּ";
                            break;

                        case 6:
                            L0.Text = "קָרוֹב אַתָּה יְהוָה";
                            L1.Text = "וְכָל מִצְוֹתֶיךָ אֱמֶת";
                            break;

                        case 7:
                            L0.Text = "קֶדֶם יָדַעְתִּי מֵעֵדֹתֶיךָ";
                            L1.Text = "כִּי לְעוֹלָם יְסַדְתָּם";
                            break;

                        default:
                            break;
                    }
            break;

            case 'ר':
            switch (fl[1])
                    {
                        case 0:
                            L0.Text = "רְאֵה עָנְיִי וְחַלְּצֵנִי";
                            L1.Text = "כִּי תוֹרָתְךָ לֹא שָׁכָחְתִּי";
                            break;

                        case 1:
                            L0.Text = "רִיבָה רִיבִי וּגְאָלֵנִי";
                            L1.Text = "לְאִמְרָתְךָ חַיֵּנִי";
                            break;

                        case 2:
                            L0.Text = "רָחוֹק מֵרְשָׁעִים יְשׁוּעָה";
                            L1.Text = "כִּי חֻקֶּיךָ לֹא דָרָשׁוּ";
                            break;

                        case 3:
                            L0.Text = "רַחֲמֶיךָ רַבִּים יְהוָה";
                            L1.Text = "כְּמִשְׁפָּטֶיךָ חַיֵּנִי";
                            break;

                        case 4:
                            L0.Text = "רַבִּים רֹדְפַי וְצָרָי";
                            L1.Text = "מֵעֵדְוֹתֶיךָ לֹא נָטִיתִי";
                            break;

                        case 5:
                            L0.Text = "רָאִיתִי בֹגְדִים וָאֶתְקוֹטָטָה";
                            L1.Text = "אֲשֶׁר אִמְרָתְךָ לֹא שָׁמָרוּ";
                            break;

                        case 6:
                            L0.Text = "רְאֵה כִּי פִקּוּדֶיךָ אָהָבְתִּי";
                            L1.Text = "יְהוָה כְּחַסְדְּךָ חַיֵּנִי";
                            break;

                        case 7:
                            L0.Text = "רֹאשׁ דְּבָרְךָ אֱמֶת";
                            L1.Text = "וּלְעוֹלָם כָּל מִשְׁפַּט צִדְקֶךָ";
                            break;

                        default:
                            break;
                    }
            break;

            case 'ש':
            switch (fl[1])
                    {
                        case 0:
                            L0.Text = "שָׂרִים רְדָפוּנִי חִנָּם";
                            L1.Text = "וּמִדְּבָרְךָ פָּחַד לִבִּי";
                            break;

                        case 1:
                            L0.Text = "שָׂשׂ אָנֹכִי עַל אִמְרָתֶךָ";
                            L1.Text = "כְּמוֹצֵא שָׁלָל רָב";
                            break;

                        case 2:
                            L0.Text = "שֶׁקֶר שָׂנֵאתִי וַאֲתַעֵבָה";
                            L1.Text = "תּוֹרָתְךָ אָהָבְתִּי";
                            break;

                        case 3:
                            L0.Text = "שֶׁבַע בַּיּוֹם הִלַּלְתִּיךָ";
                            L1.Text = "עַל מִשְׁפְּטֵי צִדְקֶךָ";
                            break;

                        case 4:
                            L0.Text = "שָׁלוֹם רָב לְאֹהֲבֵי תוֹרָתֶךָ";
                            L1.Text = "וְאֵין לָמוֹ מִכְשׁוֹל";
                            break;

                        case 5:
                            L0.Text = "שִׂבַּרְתִּי לִישׁוּעָתְךָ יְהוָה";
                            L1.Text = "וּמִצְוֹתֶיךָ עָשִׂיתִי";
                            break;

                        case 6:
                            L0.Text = "שָׁמְרָה נַפְשִׁי עֵדֹתֶיךָ";
                            L1.Text = "וָאֹהֲבֵם מְאֹד";
                            break;

                        case 7:
                            L0.Text = "שָׁמַרְתִּי פִקּוּדֶיךָ וְעֵדֹתֶיךָ";
                            L1.Text = "כִּי כָל דְּרָכַי נֶגְדֶּךָ";
                            break;

                        default:
                            break;
                    }
            break;

            case 'ת':
            switch (fl[1])
                    {
                        case 0:
                            L0.Text = "תִּקְרַב רִנָּתִי לְפָנֶיךָ";
                            L1.Text = "יְהוָה כִּדְבָרְךָ הֲבִינֵנִי";
                            break;

                        case 1:
                            L0.Text = "תָּבוֹא תְּחִנָּתִי לְפָנֶיךָ";
                            L1.Text = "כְּאִמְרָתְךָ הַצִּילֵנִי";
                            break;

                        case 2:
                            L0.Text = "תַּבַּעְנָה שְׂפָתַי תְּהִלָּה";
                            L1.Text = "כִּי תְלַמְּדֵנִי חֻקֶּיךָ";
                            break;

                        case 3:
                            L0.Text = "תַּעַן לְשׁוֹנִי אִמְרָתֶךָ";
                            L1.Text = "כִּי כָל מִצְוֹתֶיךָ צֶּדֶק";
                            break;

                        case 4:
                            L0.Text = "תְּהִי יָדְךָ לְעָזְרֵנִי";
                            L1.Text = "כִּי פִקּוּדֶיךָ בָחָרְתִּי";
                            break;

                        case 5:
                            L0.Text = "תָּאַבְתִּי לִישׁוּעָתְךָ יְהוָה";
                            L1.Text = "וְתוֹרָתְךָ שַׁעֲשֻׁעָי";
                            break;

                        case 6:
                            L0.Text = "תְּחִי נַפְשִׁי וּתְהַלְלֶךָּ";
                            L1.Text = "וּמִשְׁפָּטֶךָ יַעֲזְרֻנִי";
                            break;

                        case 7:
                            L0.Text = "תָּעִיתִי כְּשֶׂה אֹבֵד בַּקֵּשׁ עַבְדֶּךָ";
                            L1.Text = "כִּי מִצְוֹתֶיךָ לֹא שָׁכָחְתִּי";
                            break;

                        default:
                            break;
                    }
            break;



            default:
            break;
            }
            L0.ForeColor = Color.FromArgb(Y, Z, X);
            L1.ForeColor = Color.FromArgb(Y, Z, X);
        }
    }
}
